InterviewPreparationJS.tex
% Created 2021-05-26 Wed 15:35
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[0.5in]{geometry}
\author{Abul Kalam Robin}
\date{\today}
\title{Interview Preparation Js}
\hypersetup{
 pdfauthor={Abul Kalam Robin},
 pdftitle={Interview Preparation Js},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{Interview Question JavaScript}
\label{sec:org93f778f}
\begin{enumerate}
\item What is JavaScript?
\item Enumerate the differences between Java and JavaScript?
\item What are JavaScript data types?
\item How would you compare two objects in JavaScript?
\item What is the use of isNaN function?
\item As [] is true, [] == true should also be true. right?
\item How could you write a method on instance of a date which will give you next day?
\item Which is faster between JavaScript and an ASP script?
\item What is negative infinity?
\item Is it possible to break JavaScript Code into several line?
\item Which company developed JavaScript?
\item What are Undeclared and undefined variables?
\item What is global variable? How to declare global variable?
\item What is prompt box?
\item What is the working timers in JavaScript?
\item Which symbols are used to comment in JavaScript?
\item What is the difference between viewstate and sessionstate in JavaScript?
\item Does JavaScript support automatic type conversion?
\item How could you cache execution of any function?
\item What is called Variable typing in JavaScript?
\item How could you implement moveLeft animation?
\item How would you implement currying for any functions?
\item Verify a prime number.
\item Find all prime factors of a number.
\item Get nth Fibonacci number.
\item Find the greatest common divisor of two numbers.
\item Remove duplicate members from an array.
\item Merge two sorted array.
\item Swap two numbers without using a temp variable.
\item Reverse a string in JavaScript.
\item How would you reverse words in a sentence?
\item Reverse words in place.
\item Find the first non repeating char in a string.
\item Remove duplicate characters from a string.
\item How will you verify a word as palindrome?
\item Generate random between 5 to 7 by using defined function.
\item Find missing number from unsorted array of integers.
\item Get two numbers that equal to a given number.
\item Find the largest sum of any two elements
\item Total number of zeroes from 1 upto n.
\item check whether a given string is a substring of bigger string.
\item Get permutations of a string.
\item What is the event loop? Can you draw a simple diagram to explain event loop?
\item How do you explain closure?
\item How would you make sure value of this works correctly inside setTimeout
\item What are the different possible values for this?
\item What is debounce and how could you implement debounce?
\item How would you communicate with server?
\item Explain Promise.
\item If an website is slow how and what would you do to make it faster?
\item What ES\^{} feature do you use other than let, var and arrow?
\item What build tool you use and tell me some advantages to use that build tool.
\end{enumerate}
\end{document}
